RDVMI.rdvmi-ext/src/InformationRegisters/рдв_ОчередиОбработкиДанных/рдв_ОчередиОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_ОчередиОбработкиДанных</name>
  <comment>VELO-625</comment>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.рдв_СостоянияОчередейОбработкиДанных</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеПараметров</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>РазделительПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСледующейПопыткиUTC</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОстановленаОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеСостояния</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаОбработкиUTC</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаСозданияUTC</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСостоянияUTC</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПараметров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипОчереди</name>
    <type>
      <types>CatalogRef.рдв_ТипыОчередейОбработкиДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <comment>VELO-624, VELO-709, VELO-618, VELO-605, VELO-609, VELO-610, VELO-612, VELO-614, VELO-664, VELO-611, VELO-603, VELO-775, VELO-773, VELO-917, VELO-940, VELO-890, VELO-892, VELO-1584, VELO-1789, VELO-2385</comment>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХешПараметров</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/Enums/рдв_СостоянияОчередейОбработкиДанных/рдв_СостоянияОчередейОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_СостоянияОчередейОбработкиДанных</name>
  <comment>VELO-625</comment>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>Пропущена</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/InformationRegisters/рдв_ОчередиОбработкиДанных/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКоманд

&НаКлиенте
Процедура ОбработатьОчереди(Команда)
	
	КлючиЗаписейОчередей = Элементы.Список.ВыделенныеСтроки;
	Если КлючиЗаписейОчередей.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбраны строки для обработки.");
		Возврат;
	КонецЕсли;
	
	ИмяРегистраОчередей = рдв_РаботаСОчередямиКлиентСерверПереопределяемый.ИмяРегистраОчередей();
	ОбработатьОчередиНаСервере(КлючиЗаписейОчередей);
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи." + ИмяРегистраОчередей));	
	ПоказатьПредупреждение(, "Обработка данных очередей завершена.");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОчередиНаСервере(Знач КлючиЗаписейОчередей)
	
	// Группировка по типам очередей.
	ТаблицаОчердей = Новый ТаблицаЗначений;
	ТаблицаОчердей.Колонки.Добавить("ТипОчереди");
	ТаблицаОчердей.Колонки.Добавить("ИдентификаторыОчереди");
	
	ТекущаяСтрокаОчереди = Неопределено;
	Для Каждого ЗаписьОчереди Из КлючиЗаписейОчередей Цикл
		Если ТекущаяСтрокаОчереди = Неопределено 
			Или ТекущаяСтрокаОчереди.ТипОчереди <> ЗаписьОчереди.ТипОчереди Тогда
			ТекущаяСтрокаОчереди = ТаблицаОчердей.Добавить();
			ТекущаяСтрокаОчереди.ТипОчереди = ЗаписьОчереди.ТипОчереди;
			ТекущаяСтрокаОчереди.ИдентификаторыОчереди = Новый Массив;
		КонецЕсли;
		ТекущаяСтрокаОчереди.ИдентификаторыОчереди.Добавить(ЗаписьОчереди.ИдентификаторЗаписи);
	КонецЦикла;
	
	// Запуск сгруппированных по типу очередей.
	Для Каждого СтрокаОчереди Из ТаблицаОчердей Цикл
		рдв_РаботаСОчередями.ВыполнитьОбработкуОчереди(СтрокаОчереди.ТипОчереди,
			СтрокаОчереди.ИдентификаторыОчереди);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояние(Команда)
	
	КлючиЗаписейОчередей = Элементы.Список.ВыделенныеСтроки;
	Если КлючиЗаписейОчередей.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбраны строки для установки состояния.");
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("КлючиЗаписейОчередей", КлючиЗаписейОчередей);
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьСостояниеВыборСостояния", ЭтаФорма, ПараметрыОповещения);
	СостояниеПоУмолчанию = ПредопределенноеЗначение("Перечисление.рдв_СостоянияОчередейОбработкиДанных.Новая");

	ПоказатьВводЗначения(
		ОписаниеОповещения,
		СостояниеПоУмолчанию,
		НСтр("ru = 'Выборка состояния записей очередей'"),
		Тип("ПеречислениеСсылка.рдв_СостоянияОчередейОбработкиДанных")
	);

КонецПроцедуры

&НаКлиенте
Процедура ОстановитьОчереди(Команда)
	УстановитьФлагОстановкиОчереди(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОстановкуОчередей(Команда)
	УстановитьФлагОстановкиОчереди(Ложь);
КонецПроцедуры

#КонецОбласти

#Область УправлениеСостояниемОчередей

&НаКлиенте
Процедура УстановитьСостояниеВыборСостояния(Результат, ПараметрыОповещения) Экспорт

	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеСостояния = НСтр("ru = 'Изменение состояния из списка записей очередей'");
	
	УстановитьСостояниеЗаписейОчередей(
		ПараметрыОповещения.КлючиЗаписейОчередей,
		Результат, ОписаниеСостояния
	);
	
	ИмяРегистраОчередей = рдв_РаботаСОчередямиКлиентСерверПереопределяемый.ИмяРегистраОчередей();
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи." + ИмяРегистраОчередей));	

КонецПроцедуры
	
&НаСервере
Процедура УстановитьСостояниеЗаписейОчередей(Знач КлючиЗаписейОчередей, Состояние, ОписаниеСостояния = "")
	Если Состояние = Перечисления.рдв_СостоянияОчередейОбработкиДанных.Новая Тогда
		ДатаСледующейПопыткиUTC = Дата(1, 1, 1);
		ОстановленаОбработка = Ложь;
	Иначе
		ДатаСледующейПопыткиUTC = Неопределено;
		ОстановленаОбработка = Неопределено;
	КонецЕсли;
	Для Каждого КлючЗаписиОчереди Из КлючиЗаписейОчередей Цикл
		рдв_РаботаСОчередями.ИзменитьСостояниеОчереди(
			КлючЗаписиОчереди.ТипОчереди,
			КлючЗаписиОчереди.ИдентификаторЗаписи,
			Состояние,
			ОписаниеСостояния,
			ДатаСледующейПопыткиUTC,
			ОстановленаОбработка
		);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагОстановкиОчереди(Остановлена)

	КлючиЗаписейОчередей = Элементы.Список.ВыделенныеСтроки;
	Если КлючиЗаписейОчередей.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбраны строки для изменения флага остановки обработки очередей.");
		Возврат;
	КонецЕсли;
	
	Если Остановлена Тогда
		ТекстВопроса = НСтр("ru = 'Выбранные очереди не будут обрабатываться после установки флага остановки. Продожить?'");
	Иначе
		ТекстВопроса = НСтр("ru = 'У выбранных очередей будет снят флаг остановки, очереди будут отправлены в обработку. Продожить?'");
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("КлючиЗаписейОчередей", КлючиЗаписейОчередей);
	ПараметрыОповещения.Вставить("ОстановленаОбработка", Остановлена);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьФлагОстановкиОчередиВопросЗавершение", ЭтаФорма, ПараметрыОповещения);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагОстановкиОчередиВопросЗавершение(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьФлагОстановкиОчередиНаСервере(
		ПараметрыОповещения.КлючиЗаписейОчередей,
		ПараметрыОповещения.ОстановленаОбработка
	);
	
	ИмяРегистраОчередей = рдв_РаботаСОчередямиКлиентСерверПереопределяемый.ИмяРегистраОчередей();
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи." + ИмяРегистраОчередей));	

КонецПроцедуры

&НаСервере
Процедура УстановитьФлагОстановкиОчередиНаСервере(КлючиЗаписейОчередей, Остановлена)
	Если Не Остановлена Тогда
		ДатаСледующейПопыткиUTC = Дата(1, 1, 1);
	Иначе
		ДатаСледующейПопыткиUTC = Неопределено;
	КонецЕсли;
	Для Каждого КлючЗаписиОчереди Из КлючиЗаписейОчередей Цикл
		рдв_РаботаСОчередями.ИзменитьСостояниеОчереди(
			КлючЗаписиОчереди.ТипОчереди,
			КлючЗаписиОчереди.ИдентификаторЗаписи,,,
			ДатаСледующейПопыткиUTC,
			Остановлена
		);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
